STM8-SPL-license/discussion/Header/STM8AF_STM8S_bitfield (Kopie 1).h
///< irq23 - TIM4, TIM6 Update/Overflow interrupt
#if defined(TIM4_BaseAddress)
  #define __TIM4_UPD_OVF_VECTOR__ 23    ///< irq23 - TIM4 Update/Overflow interrupt
#elif defined(TIM6_BaseAddress)
  #define __TIM6_UPD_OVF_VECTOR__ 23    ///< irq23 - TIM6 Update/Overflow interrupt
#endif

/// irq24 - flash interrupt
#define __FLASH_VECTOR__          24


/*-----------------------------------------------------------------------------
    DECLARATION OF GLOBAL TYPEDEFS
-----------------------------------------------------------------------------*/

/** union for bit- or bytewise r/w-access to 8-bit data (byte_t) */
typedef union {

  /// for byte access
  uint8_t  Byte;
  
  /// for bitwise access
  struct {
    int    b0 : 1;     ///< bit 0 in byte
    int    b1 : 1;     ///< bit 1 in byte
    int    b2 : 1;     ///< bit 2 in byte
    int    b3 : 1;     ///< bit 3 in byte
    int    b4 : 1;     ///< bit 4 in byte
    int    b5 : 1;     ///< bit 5 in byte
    int    b6 : 1;     ///< bit 6 in byte
    int    b7 : 1;     ///< bit 7 in byte
  } Bit;
  
} byte_t;


/** struct for bytewise r/w access to 16bit data (word_t)
 \note
   order of r/w access is important and cannot be guaranteed in C --> don't use union like for byte_t
     - write: HB+LB ok / LB+HB and word fails! \n
     - read: LB+HB and word ok / HB+LB fails! \n
*/
typedef struct {
  uint8_t byteH;        ///< high byte in 16b word
  uint8_t byteL;        ///< low byte in 16b word
} word_t;


/*-----------------------------------------------------------------------------
    DEFINITION OF STM8 PERIPHERAL REGISTERS
-----------------------------------------------------------------------------*/

//------------------------
// PORT ports (implemented on all devices)
//------------------------
#if (1)   // dummy for filtering out in editor

  /** structure for controlling/monitoring pins in PORT mode (PORT_t) */
  typedef struct {
    byte_t ODR;     ///< Port x output data register (Px_ODR)
    byte_t IDR;     ///< Port x pin input register (Px_IDR)
    byte_t DDR;     ///< Port x data direction register (Px_DDR)
    byte_t CR1;     ///< Port x control register 1 (Px_CR1)
    byte_t CR2;     ///< Port x control register 2 (Px_CR2)
  } PORT_t;

  // port A..F implemented on all devices
  #if defined(PORTA_BaseAddress)
    #define _GPIOA  (*((PORT_t *) PORTA_BaseAddress))   ///< registers for port A access
  #endif
  #if defined(PORTB_BaseAddress)
    #define _GPIOB  (*((PORT_t *) PORTB_BaseAddress))   ///< registers for port B access
  #endif
  #if defined(PORTC_BaseAddress)
    #define _GPIOC  (*((PORT_t *) PORTC_BaseAddress))   ///< registers for port C access
  #endif
  #if defined(PORTD_BaseAddress)
    #define _GPIOD  (*((PORT_t *) PORTD_BaseAddress))   ///< registers for port D access
  #endif
  #if defined(PORTE_BaseAddress)
    #define _GPIOE  (*((PORT_t *) PORTE_BaseAddress))   ///< registers for port E access
  #endif
  #if defined(PORTF_BaseAddress)
    #define _GPIOF  (*((PORT_t *) PORTF_BaseAddress))   ///< registers for port F access
  #endif

  // port G+H+I implemented on selected devices
  #if defined(PORTG_BaseAddress)
    #define _GPIOG  (*((PORT_t *) PORTG_BaseAddress))   ///< registers for port G access
  #endif
  #if defined(PORTH_BaseAddress)
    #define _GPIOH  (*((PORT_t *) PORTH_BaseAddress))   ///< registers for port H access
  #endif
  #if defined(PORTI_BaseAddress)
    #define _GPIOI  (*((PORT_t *) PORTI_BaseAddress))   ///< registers for port I access
  #endif

  /* macro for readability (all ports) */
  #define Pin0   Bit.b0
  #define Pin1   Bit.b1
  #define Pin2   Bit.b2
  #define Pin3   Bit.b3
  #define Pin4   Bit.b4
  #define Pin5   Bit.b5
  #define Pin6   Bit.b6
  #define Pin7   Bit.b7

  /* PORT Module Reset Values (all ports) */
  #define PORT_ODR_RESET_VALUE ((uint8_t)0x00)
  #define PORT_DDR_RESET_VALUE ((uint8_t)0x00)
  #define PORT_CR1_RESET_VALUE ((uint8_t)0x00)
  #define PORT_CR2_RESET_VALUE ((uint8_t)0x00)

#endif // (1)



//------------------------
// Clock module CLK (implemented on all devices)
//------------------------
#if (1)   // dummy for filtering out in editor

  /** struct containing clock module registers (CLK) */
  typedef struct {

    /** Internal clock register (CLK_ICKR) */
    union {
    
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    HSIEN   : 1;    ///< High speed internal RC oscillator enable
        int    HSIRDY  : 1;    ///< High speed internal oscillator ready flag
        int    FHW     : 1;    ///< Fast wakeup from Halt/Active-halt modes enable
        int    LSIEN   : 1;    ///< Low speed internal RC oscillator enable
        int    LSIRDY  : 1;    ///< Low speed internal oscillator ready flag
        int    REGAH   : 1;    ///< Regulator power off in Active-halt mode enable
        int    res     : 2;    ///< Reserved, must be kept cleared
      } Reg;
      
    } ICKR;


    /** External clock register (CLK_ECKR) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    HSEEN   : 1;    ///< High speed external crystal oscillator enable
        int    HSERDY  : 1;    ///< High speed external crystal oscillator ready
        int    res     : 6;    ///< Reserved, must be kept cleared
      } Reg;
      
    } ECKR;


    /** Reserved register (1B) */
    uint8_t         res[1]; 


    /** Clock master status register (CLK_CMSR) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    CKM     : 8;    ///< Clock master status bits
      } Reg;
      
    } CMSR;


    /** Clock master switch register (CLK_SWR) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    SWI     : 8;    ///< Clock master selection bits
      } Reg;
      
    } SWR;


    /** Switch control register (CLK_SWCR) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    SWBSY   : 1;    ///< Switch busy flag
        int    SWEN    : 1;    ///< Switch start/stop enable
        int    SWIEN   : 1;    ///< Clock switch interrupt enable
        int    SWIF    : 1;    ///< Clock switch interrupt flag
        int    res     : 4;    ///< Reserved
      } Reg;

