STM8-SPL-license/discussion/Header/STM8AF_STM8S_bitfield (Kopie 1).h
#endif // (1)



//------------------------
// Independent Timeout Watchdog IWDG (implemented on all devices)
//------------------------
#if (1)   // dummy for filtering out in editor

  /** struct containing IWDG independent watchdog registers */
  typedef struct {

    /** IWDG Key register (IWDG_KR) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    KEY     : 8;    ///< IWDG key value
      } Reg;
      
    } KR;


    /** IWDG Prescaler register (IWDG_PR) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    PR      : 3;    ///< Prescaler divider
        int    res     : 5;    ///< Reserved
      } Reg;
      
    } PR;


    /** IWDG Reload register (IWDG_RLR) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    RL      : 8;    ///< Watchdog counter reload value
      } Reg;
      
    } RLR;

  } IWDG_t;

  /// pointer to all IWDG independent timeout watchdog registers (all devices)
  #if defined(IWDG_BaseAddress)
    #define _IWDG  (*((IWDG_t *) IWDG_BaseAddress))
  #endif

  /* IWDG Module Reset Values */
  #define IWDG_PR_RESET_VALUE  ((uint8_t)0x00)
  #define IWDG_RLR_RESET_VALUE ((uint8_t)0xFF)

#endif // (1)



//------------------------
// NVM Module FLASH (all devices, but differet sizes)
//------------------------
#if (1)   // dummy for filtering out in editor

  /** struct containing FLASH memory registers */
  typedef struct {

    /** Flash control register 1 (FLASH_CR1) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    FIX     : 1;    ///< Fixed Byte programming time
        int    IE      : 1;    ///< Flash Interrupt enable
        int    AHALT   : 1;    ///< Power-down in Active-halt mode
        int    HALT    : 1;    ///< Power-down in Halt mode
        int    res     : 4;    ///< Reserved
      } Reg;
    } CR1;


    /** Flash control register 2 (FLASH_CR2) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    PRG     : 1;    ///< Standard block programming
        int    res     : 3;    ///< Reserved
        int    FPRG    : 1;    ///< Fast block programming
        int    ERASE   : 1;    ///< Block erasing
        int    WPRG    : 1;    ///< Word programming
        int    OPT     : 1;    ///< Write option bytes
      } Reg;

    } CR2;


    /** complementary Flash control register 2 (FLASH_CR2) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    PRG     : 1;    ///< Standard block programming
        int    res     : 3;    ///< Reserved
        int    FPRG    : 1;    ///< Fast block programming
        int    ERASE   : 1;    ///< Block erasing
        int    WPRG    : 1;    ///< Word programming
        int    OPT     : 1;    ///< Write option bytes
      } Reg;

    } NCR2;


    /** Flash protection register (FLASH_FPR) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    WPB     : 6;    ///< User boot code area protection bits
        int    res     : 2;    ///< Reserved
      } Reg;

    } FPR;


    /** complementary Flash protection register (FLASH_FPR) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    WPB     : 6;    ///< User boot code area protection bits
        int    res     : 2;    ///< Reserved
      } Reg;

    } NFPR;


    /** Flash status register (FLASH_IAPSR) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    WR_PG_DIS : 1;  ///< Write attempted to protected page flag
        int    PUL       : 1;  ///< Flash Program memory unlocked flag
        int    EOP       : 1;  ///< End of programming (write or erase operation) flag
        int    DUL       : 1;  ///< Data EEPROM area unlocked flag
        int    res       : 2;  ///< Reserved, forced by hardware to 0
        int    HVOFF     : 1;  ///< End of high voltage flag
        int    res2      : 1;  ///< Reserved
      } Reg;

    } IAPSR;


    /** Reserved registers (2B) */
    uint8_t         res[2]; 


    /** Flash program memory unprotecting key register (FLASH_PUKR) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    PUK     : 8;    ///< Main program memory unlock keys
      } Reg;
      
    } PUKR;


    /** Reserved register (1B) */
    uint8_t         res2[1]; 


    /** Data EEPROM unprotection key register (FLASH_DUKR) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    DUK     : 8;    ///< Data EEPROM write unlock keys
      } Reg;
      
    } DUKR;

  } FLASH_t;

  /// pointer to all Flash registers (all devices, but differet sizes)
  #if defined(FLASH_BaseAddress)
    #define _FLASH  (*((FLASH_t *) FLASH_BaseAddress))
  #endif

  /* FLASH Module Reset Values */
  #define FLASH_CR1_RESET_VALUE   ((uint8_t)0x00)
  #define FLASH_CR2_RESET_VALUE   ((uint8_t)0x00)
  #define FLASH_NCR2_RESET_VALUE  ((uint8_t)0xFF)
  #define FLASH_IAPSR_RESET_VALUE ((uint8_t)0x40)
  #define FLASH_PUKR_RESET_VALUE  ((uint8_t)0x00)
  #define FLASH_DUKR_RESET_VALUE  ((uint8_t)0x00)

