STM8-SPL-license/discussion/Header/STM8AF_STM8S_bitfield (Kopie 1).h
#endif // (1)



//------------------------
// Auto Wake-Up Module AWU (implemented on all devices)
//------------------------
#if (1)   // dummy for filtering out in editor

  /** struct containing AWU module registers */
  typedef struct {

    /** AWU Control/status register (AWU_CSR) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    MSR     : 1;    ///< LSI measurement enable
        int    res     : 3;    ///< Reserved
        int    AWUEN   : 1;    ///< Auto-wakeup enable
        int    AWUF    : 1;    ///< Auto-wakeup flag
        int    res2    : 2;    ///< Reserved
      } Reg;

    } CSR;


    /** AWU Asynchronous prescaler register (AWU_APR) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    APR     : 6;    ///< Asynchronous prescaler divider
        int    res     : 2;    ///< Reserved
      } Reg;
      
    } APR;


    /** AWU Timebase selection register (AWU_TBR) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    AWUTB   : 4;    ///< Auto-wakeup timebase selection
        int    res     : 4;    ///< Reserved
      } Reg;

    } TBR;

  } AWU_t;

  /// pointer to all AWU registers (all devices)
  #if defined(AWU_BaseAddress)
    #define _AWU  (*((AWU_t *) AWU_BaseAddress))
  #endif

  /* AWU Module Reset Values */
  #define AWU_CSR_RESET_VALUE ((uint8_t)0x00)
  #define AWU_APR_RESET_VALUE ((uint8_t)0x3F)
  #define AWU_TBR_RESET_VALUE ((uint8_t)0x00)

#endif // (1)



//------------------------
// Beeper module BEEP (all devices, may require option byte change)
//------------------------
#if (1)   // dummy for filtering out in editor

  /** struct containing BEEP registers */
  typedef struct {

    /** Beeper control/status register (BEEP_CSR) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    BEEPDIV : 5;    ///< Beep clock prescaler divider
        int    BEEPEN  : 1;    ///< Beep enable
        int    BEEPSEL : 2;    ///< Beeper frequency selection
      } Reg;
      
    } CSR;

  } BEEP_t;

  /// register for beeper control (all devices)
  #if defined(BEEP_BaseAddress)
    #define _BEEP  (*((BEEP_t *) BEEP_BaseAddress))
  #endif

  /* BEEP Module Reset Values */
  #define BEEP_CSR_RESET_VALUE ((uint8_t)0x1F)

#endif // (1)



//------------------------
// Reset Module RST (all devices)
//------------------------
#if (1)   // dummy for filtering out in editor

  /** struct containing RST registers */
  typedef struct {

    /** Reset status register (RST_SR) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    WWDGF   : 1;    ///< Window Watchdog reset flag
        int    IWDGF   : 1;    ///< Independent Watchdog reset flag
        int    ILLOPF  : 1;    ///< Illegal opcode reset flag
        int    SWIMF   : 1;    ///< SWIM reset flag
        int    EMCF    : 1;    ///< EMC reset flag
        int    res     : 3;    ///< Reserved
      } Reg;

    } SR;

  } RST_t;

  /// register for reset status module (all devices)
  #if defined(RST_BaseAddress)
    #define _RST  (*((RST_t *) RST_BaseAddress))
  #endif

#endif // (1)



//------------------------
// Global Configuration CFG (all devices)
//------------------------
#if (1)   // dummy for filtering out in editor

  /** struct containing CFG registers */
  typedef struct {

    /** Global configuration register (CFG_GCR) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    SWD     : 1;    ///< SWIM disable
        int    AL      : 1;    ///< Activation level
        int    res     : 6;    ///< Reserved
      } Reg;
      
    } GCR;

  } CFG_t;

  /// register for CFG module (all devices)
  #if defined(CFG_BaseAddress)
    #define _CFG  (*((CFG_t *) CFG_BaseAddress))
  #endif

  /* CFG Module Reset Values */
  #define CFG_GCR_RESET_VALUE ((uint8_t)0x00)

#endif // (1)



//------------------------
// External Interrupt Control EXTI (all devices)
//------------------------
#if (1)   // dummy for filtering out in editor

  /** struct containing EXTI registers */
  typedef struct {

    /** External interrupt control register 1 (EXTI_CR1) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    PAIS    : 2;    ///< Port A external interrupt sensitivity bits
        int    PBIS    : 2;    ///< Port B external interrupt sensitivity bits
        int    PCIS    : 2;    ///< Port C external interrupt sensitivity bits
        int    PDIS    : 2;    ///< Port D external interrupt sensitivity bits
      } Reg;

    } CR1;


    /** External interrupt control register 2 (EXTI_CR2) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    PEIS    : 2;    ///< Port E external interrupt sensitivity bits
        int    TLIS    : 1;    ///< Top level interrupt sensitivity
        int    res     : 5;    ///< Reserved
      } Reg;

    } CR2;

  } EXTI_t;

  /// pointer to all EXTI registers (all devices)
  #if defined(EXTI_BaseAddress)
    #define _EXTI  (*((EXTI_t *) EXTI_BaseAddress))
  #endif

  /* EXTI Module Reset Values */
  #define EXTI_CR1_RESET_VALUE ((uint8_t)0x00)
  #define EXTI_CR2_RESET_VALUE ((uint8_t)0x00)

