STM8-SPL-license/discussion/Header/STM8AF_STM8S_bitfield (Kopie 1).h
#endif // (1)



//------------------------
// Interrupt Priority Module ITC (all devices)
//------------------------
#if (1)   // dummy for filtering out in editor

  /** struct containing ITC registers */
  typedef struct {

    /** Software priority register 1/8 (ITC_SPR1) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    res       : 2;    ///< Reserved
        int    AWU       : 2;    ///< AWU (=irq1) interrupt priority 
        int    CLK       : 2;    ///< CLK (=irq2) interrupt priority 
        int    EXTI_A    : 2;    ///< EXINT on port A (=irq3) interrupt priority
      } Reg;

    } SPR1;


    /** Software priority register 2/8 (ITC_SPR2) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    EXTI_B    : 2;    ///< EXINT on port B (=irq4) interrupt priority
        int    EXTI_C    : 2;    ///< EXINT on port C (=irq5) interrupt priority
        int    EXTI_D    : 2;    ///< EXINT on port D (=irq6) interrupt priority
        int    EXTI_E    : 2;    ///< EXINT on port E (=irq7) interrupt priority
      } Reg;

    } SPR2;


    /** Software priority register 3/8 (ITC_SPR3) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    CAN_RX    : 2;    ///< CAN Rx (=irq8) interrupt priority 
        int    CAN_TX    : 2;    ///< CAN Tx (=irq9) interrupt priority 
        int    SPI       : 2;    ///< SPI (=irq10) interrupt priority 
        int    TIM1_UPD  : 2;    ///< TIM1 Update (=irq11) interrupt priority 
      } Reg;

    } SPR3;


    /** Software priority register 4/8 (ITC_SPR4) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    TIM1_CAP  : 2;    ///< TIM1 Capture/Compare (=irq12) interrupt priority 
        int    TIM2_UPD  : 2;    ///< TIM2 Update (=irq13) interrupt priority 
        int    TIM2_CAP  : 2;    ///< TIM2 Capture/Compare (=irq14) interrupt priority 
        int    TIM3_UPD  : 2;    ///< TIM3 Update (=irq15) interrupt priority (Reserved)
      } Reg;

    } SPR4;


    /** Software priority register 5/8 (ITC_SPR5) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    TIM3_CAP  : 2;    ///< TIM3 Capture/Compare (=irq16) interrupt priority (Reserved)
        int    UART1_TX  : 2;    ///< UART1/USART Tx complete (=irq17) interrupt priority 
        int    UART1_RX  : 2;    ///< UART1/USART Rx full (=irq18) interrupt priority 
        int    I2C       : 2;    ///< I2C (=irq19) interrupt priority 
      } Reg;

    } SPR5;


    /** Software priority register 6/8 (ITC_SPR6) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    UART234_TX : 2;    ///< UART234/LINUART Tx complete (=irq20) interrupt priority 
        int    UART234_RX : 2;    ///< UART234/LINUART Rx full (=irq21) interrupt priority 
        int    ADC        : 2;    ///< ADC (=irq22) interrupt priority 
        int    TIM4_UPD   : 2;    ///< TIM4 Update (=irq23) interrupt priority (Reserved)
      } Reg;

    } SPR6;


    /** Software priority register 7/8 (ITC_SPR7) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    FLASH     : 2;    ///< flash (=irq24) interrupt priority 
        int    VECT25    : 2;    ///< irq25 interrupt priority (not documented)
        int    VECT26    : 2;    ///< irq26 interrupt priority (not documented)
        int    VECT27    : 2;    ///< irq27 interrupt priority (not documented)
      } Reg;

    } SPR7;


    /** Software priority register 8/8 (ITC_SPR8) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    VECT28    : 2;    ///< irq28 interrupt priority (not documented)
        int    res       : 6;    ///< Reserved
      } Reg;

    } SPR8;

  } ITC_t;

  /// register for ITC control (all devices)
  #if defined(ITC_BaseAddress)
    #define _ITC  (*((ITC_t *) ITC_BaseAddress))
  #endif

  /* ITC Module Reset Values (all registers) */
  #define ITC_SPRX_RESET_VALUE ((uint8_t)0xFF)

#endif // (1)



//------------------------
// Serial Peripheral Interface SPI (all devices)
//------------------------
#if (1)   // dummy for filtering out in editor

  /** struct containing SPI registers */
  typedef struct {

    /** SPI control register 1 (SPI_CR1) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    CPHA     : 1;    ///< Clock phase
        int    CPOL     : 1;    ///< Clock polarity
        int    MSTR     : 1;    ///< Master/slave selection
        int    BR       : 3;    ///< Baudrate control
        int    SPE      : 1;    ///< SPI enable
        int    xLSBFIRST : 1;    ///< Frame format. Add x to avoid conflict with misc.h
      } Reg;

    } CR1;


    /** SPI control register 2 (SPI_CR2) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    SSI     : 1;    ///< Internal slave select
        int    SSM     : 1;    ///< Software slave management
        int    RXONLY  : 1;    ///< Receive only
        int    res     : 1;    ///< Reserved
        int    CRCNEXT : 1;    ///< Transmit CRC next
        int    CRCEN   : 1;    ///< Hardware CRC calculation enable
        int    BDOE    : 1;    ///< Input/Output enable in bidirectional mode
        int    BDM     : 1;    ///< Bidirectional data mode enable
      } Reg;

