STM8-SPL-license/discussion/Header/STM8AF_STM8S_bitfield (Kopie 1).h
    } CR2;


    /** SPI interrupt control register (SPI_ICR) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    res     : 4;    ///< Reserved
        int    WKIE    : 1;    ///< Wakeup interrupt enable
        int    ERRIE   : 1;    ///< Error interrupt enable
        int    RXIE    : 1;    ///< Rx buffer not empty interrupt enable
        int    TXIE    : 1;    ///< Tx buffer empty interrupt enable
      } Reg;

    } ICR;


    /** SPI status register (SPI_SR) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    RXNE    : 1;    ///< Receive buffer not empty
        int    TXE     : 1;    ///< Transmit buffer empty
        int    res     : 1;    ///< Reserved
        int    WKUP    : 1;    ///< Wakeup flag
        int    CRCERR  : 1;    ///< CRC error flag
        int    MODF    : 1;    ///< Mode fault
        int    OVR     : 1;    ///< Overrun flag
        int    BSY     : 1;    ///< Busy flag
      } Reg;

    } SR;


    /** SPI data register (SPI_DR) */
    byte_t      DR; 
    
    
    /** SPI CRC polynomial register (SPI_CRCPR) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    CRCPOLY : 8;    ///< CRC polynomial register
      } Reg;
      
    } CRCPR;


    /** SPI Rx CRC register (SPI_RXCRCR) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    RxCRC   : 8;    ///< Rx CRC Register
      } Reg;
      
    } RXCRCR;


    /** SPI Tx CRC register (SPI_TXCRCR) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    TxCRC   : 8;    ///< Tx CRC register
      } Reg;
      
    } TXCRCR;

  } SPI_t;

  /// register for SPI control
  #if defined(SPI_BaseAddress)
    #define _SPI  (*((SPI_t *) SPI_BaseAddress))
  #endif

  /* SPI Module Reset Values */
  #define SPI_CR1_RESET_VALUE    ((uint8_t)0x00) /*!< Control Register 1 reset value */
  #define SPI_CR2_RESET_VALUE    ((uint8_t)0x00) /*!< Control Register 2 reset value */
  #define SPI_ICR_RESET_VALUE    ((uint8_t)0x00) /*!< Interrupt Control Register reset value */
  #define SPI_SR_RESET_VALUE     ((uint8_t)0x02) /*!< Status Register reset value */
  #define SPI_DR_RESET_VALUE     ((uint8_t)0x00) /*!< Data Register reset value */
  #define SPI_CRCPR_RESET_VALUE  ((uint8_t)0x07) /*!< Polynomial Register reset value */
  #define SPI_RXCRCR_RESET_VALUE ((uint8_t)0x00) /*!< RX CRC Register reset value */
  #define SPI_TXCRCR_RESET_VALUE ((uint8_t)0x00) /*!< TX CRC Register reset value */

#endif // (1)



//------------------------
// I2C Bus Interface (all devices)
//------------------------
#if (1)   // dummy for filtering out in editor

  /** struct containing I2C registers */
  typedef struct {

    /** I2C Control register 1 (I2C_CR1) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    PE        : 1;    ///< Peripheral enable
        int    res       : 5;    ///< Reserved
        int    ENGC      : 1;    ///< General call enable
        int    NOSTRETCH : 1;    ///< Clock stretching disable (Slave mode)
      } Reg;

    } CR1;


    /** I2C Control register 2 (I2C_CR2) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    START     : 1;    ///< Start generation
        int    STOP      : 1;    ///< Stop generation
        int    ACK       : 1;    ///< Acknowledge enable
        int    POS       : 1;    ///< Acknowledge position (for data reception)
        int    res       : 3;    ///< Reserved
        int    SWRST     : 1;    ///< Software reset
      } Reg;

    } CR2;


    /** I2C Frequency register (I2C_FREQR) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    FREQ      : 6;    ///< Peripheral clock frequency
        int    res       : 2;    ///< Reserved
      } Reg;

    } FREQR;


    /** I2C Own address register LSB (I2C_OARL) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    ADD0      : 1;    ///< Interface address [10] (in 10-bit address mode)
        int    ADD       : 7;    ///< Interface address [7:1]
      } Reg;

    } OARL;


    /** I2C own address high (I2C_OARH) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    res       : 1;    ///< Reserved
        int    ADD       : 2;    ///< Interface address [9:8] (in 10-bit address mode)
        int    res2      : 3;    ///< Reserved
        int    ADDCONF   : 1;    ///< Address mode configuration (must always be written as ‘1’)
        int    ADDMODE   : 1;    ///< 7-/10-bit addressing mode (Slave mode)
      } Reg;
      
    } OARH;


    /** Reserved register (1B) */
    uint8_t         res[1]; 


    /** I2C data register (I2C_DR) */
    byte_t          DR; 


    /** I2C Status register 1 (I2C_SR1) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    SB        : 1;    ///< Start bit (Mastermode)
        int    ADDR      : 1;    ///< Address sent (master mode) / matched (slave mode)
        int    BTF       : 1;    ///< Byte transfer finished
        int    ADD10     : 1;    ///< 10-bit header sent (Master mode)
        int    STOPF     : 1;    ///< Stop detection (Slave mode)
        int    res       : 1;    ///< Reserved
        int    RXNE      : 1;    ///< Data register not empty (receivers)
        int    TXE       : 1;    ///< Data register empty (transmitters)
      } Reg;
      
