STM8-SPL-license/discussion/Header/STM8AF_STM8S_bitfield (Kopie 1).h
    } SR1;


    /** I2C Status register 2 (I2C_SR2) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    BERR      : 1;    ///< Bus error
        int    ARLO      : 1;    ///< Arbitration lost (master mode)
        int    AF        : 1;    ///< Acknowledge failure
        int    OVR       : 1;    ///< Overrun/underrun
        int    res       : 1;    ///< Reserved
        int    WUFH      : 1;    ///< Wakeup from Halt
        int    res2      : 2;    ///< Reserved
      } Reg;
      
    } SR2;


    /** I2C Status register 3 (I2C_SR3) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    MSL       : 1;    ///< Master/Slave
        int    BUSY      : 1;    ///< Bus busy
        int    TRA       : 1;    ///< Transmitter/Receiver
        int    res       : 1;    ///< Reserved
        int    GENCALL   : 1;    ///< General call header (Slavemode)
        int    res2      : 3;    ///< Reserved
      } Reg;
      
    } SR3;


    /** I2C Interrupt register (I2C_ITR) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    ITERREN   : 1;    ///< Error interrupt enable
        int    ITEVTEN   : 1;    ///< Event interrupt enable
        int    ITBUFEN   : 1;    ///< Buffer interrupt enable
        int    res       : 5;    ///< Reserved
      } Reg;
      
    } ITR;


    /** I2C Clock control register low (I2C_CCRL) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    CCR       : 8;    ///< Clock control register (Master mode)
      } Reg;
      
    } CCRL;


    /** I2C Clock control register high (I2C_CCRH) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    CCR       : 4;    ///< Clock control register in Fast/Standard mode (Master mode)
        int    res       : 2;    ///< Reserved
        int    DUTY      : 1;    ///< Fast mode duty cycle
        int    FS        : 1;    ///< I2C master mode selection
      } Reg;
      
    } CCRH;


    /** I2C TRISE register (I2C_TRISER) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    TRISE     : 6;    ///< Maximum rise time in Fast/Standard mode (Master mode)
        int    res       : 2;    ///< Reserved
      } Reg;
      
    } TRISER;


    /** Reserved register (1B). Was I2C packet error checking (undocumented in STM8 UM rev 9) */
    uint8_t         res2[1]; 
    /*
    union {
      uint8_t  Byte;
      struct {
        int    res       : 8;
      } Reg;
    } PECR;
    */

  } I2C_t;

  /// pointer to all I2C registers (all devices)
  #if defined(I2C_BaseAddress)
    #define _I2C  (*((I2C_t *) I2C_BaseAddress))
  #endif

  /* I2C Module Reset Values */
  #define I2C_CR1_RESET_VALUE    ((uint8_t)0x00)
  #define I2C_CR2_RESET_VALUE    ((uint8_t)0x00)
  #define I2C_FREQR_RESET_VALUE  ((uint8_t)0x00)
  #define I2C_OARL_RESET_VALUE   ((uint8_t)0x00)
  #define I2C_OARH_RESET_VALUE   ((uint8_t)0x00)
  #define I2C_DR_RESET_VALUE     ((uint8_t)0x00)
  #define I2C_SR1_RESET_VALUE    ((uint8_t)0x00)
  #define I2C_SR2_RESET_VALUE    ((uint8_t)0x00)
  #define I2C_SR3_RESET_VALUE    ((uint8_t)0x00)
  #define I2C_ITR_RESET_VALUE    ((uint8_t)0x00)
  #define I2C_CCRL_RESET_VALUE   ((uint8_t)0x00)
  #define I2C_CCRH_RESET_VALUE   ((uint8_t)0x00)
  #define I2C_TRISER_RESET_VALUE ((uint8_t)0x02)

#endif // (1)


//------------------------
// Controller Area Network CAN Module (selected devices)
//------------------------
#if (1)   // dummy for filtering out in editor

  /** struct containing CAN registers (selected devices) */
  typedef struct {

    /** CAN master control register (CAN.MCR) */
    union {
  
      /// bytewise access to register
      uint8_t  Byte;
  
      /// bitwise access to register
      struct {
        int    INRQ      : 1;    ///< Initialization Request
        int    SLEEP     : 1;    ///< Sleep Mode Request
        int    TXFP      : 1;    ///< Transmit FIFO Priority
        int    RFLM      : 1;    ///< Receive FIFO Locked Mode
        int    NART      : 1;    ///< No Automatic Retransmission
        int    AWUM      : 1;    ///< Automatic Wakeup Mode
        int    ABOM      : 1;    ///< Automatic Bus-Off Management
        int    TTCM      : 1;    ///< Time Triggered Communication Mode
      } Reg;
  
    } MCR;


    /** CAN master status register (CAN.MSR) */
    union {
  
      /// bytewise access to register
      uint8_t  Byte;
  
      /// bitwise access to register
      struct {
        int    INAK      : 1;    ///< Initialization Acknowledge
        int    SLAK      : 1;    ///< Sleep Acknowledge
        int    ERRI      : 1;    ///< Error Interrupt
        int    WKUI      : 1;    ///< Wakeup Interrupt
        int    TX        : 1;    ///< Transmit
        int    RX        : 1;    ///< Receive
        int    res       : 2;    ///< Reserved
      } Reg;
  
    } MSR;


    /** CAN transmit status register (CAN.TSR) */
    union {
  
      /// bytewise access to register
      uint8_t  Byte;
  
      /// bitwise access to register
      struct {
        int    RQCP0     : 1;    ///< Request Completed for Mailbox 0 
        int    RQCP1     : 1;    ///< Request Completed for Mailbox 1
        int    RQCP2     : 1;    ///< Request Completed for Mailbox 2
        int    res       : 1;    ///< Reserved
        int    TXOK0     : 1;    ///< Transmission ok for Mailbox 0
        int    TXOK1     : 1;    ///< Transmission ok for Mailbox 1
        int    TXOK2     : 1;    ///< Transmission ok for Mailbox 2
        int    res2      : 1;    ///< Reserved
      } Reg;
  
    } TSR;


    /** CAN transmit priority register (CAN.TPR) */
    union {
  
      /// bytewise access to register
      uint8_t  Byte;
  
      /// bitwise access to register
      struct {
        int    CODE      : 2;    ///< Mailbox Code
        int    TME0      : 1;    ///< Transmit Mailbox 0 Empty
        int    TME1      : 1;    ///< Transmit Mailbox 1 Empty
        int    TME2      : 1;    ///< Transmit Mailbox 2 Empty
        int    LOW0      : 1;    ///< Lowest Priority Flag for Mailbox 0
        int    LOW1      : 1;    ///< Lowest Priority Flag for Mailbox 1
        int    LOW2      : 1;    ///< Lowest Priority Flag for Mailbox 2
      } Reg;
  
    } TPR;


    /** CAN receive FIFO register (CAN.RFR) */
    union {
  
      /// bytewise access to register
      uint8_t  Byte;
  
      /// bitwise access to register
      struct {
        int    FMP       : 2;    ///< FIFO Message Pending
        int    res       : 1;    ///< Reserved
        int    FULL      : 1;    ///< FIFO Full
        int    FOVR      : 1;    ///< FIFO Overrun
        int    RFOM      : 1;    ///< Release FIFO Output Mailbox
        int    res2      : 2;    ///< Reserved    
      } Reg;

    } RFR;


    /** CAN interrupt enable register (CAN.IER) */
    union {
  
      /// bytewise access to register
      uint8_t  Byte;
  
      /// bitwise access to register
      struct {
        int    TMEIE     : 1;    ///< Transmit Mailbox Empty Interrupt Enable
        int    FMPIE     : 1;    ///< FIFO Message Pending Interrupt Enable
        int    FFIE      : 1;    ///< FIFO Full Interrupt Enable
        int    FOVIE     : 1;    ///< FIFO Overrun Interrupt Enable
        int    res       : 3;    ///< Reserved
        int    WKUIE     : 1;    ///< Wakeup Interrupt Enable
      } Reg;

    } IER;


    /** CAN diagnosis register (CAN.DGR) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    LBKM      : 1;    ///< Loop back mode
        int    SILM      : 1;    ///< Silent mode
        int    SAMP      : 1;    ///< Last sample point
        int    RX        : 1;    ///< CAN Rx Signal
        int    TXM2E     : 1;    ///< TX Mailbox 2 enable
        int    res       : 3;    ///< Reserved
      } Reg;
      
    } DGR;


    /** CAN page selection register for below paged registers (CAN.PSR) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    PS        : 3;    ///< Page select
        int    res       : 5;    ///< Reserved
      } Reg;
      
    } PSR;



    /** paged CAN registers (selection via CAN.PSR) */
    union {
    
