STM8-SPL-license/discussion/Header/STM8AF_STM8S_bitfield (Kopie 1).h
      /** CAN page 0,1,5: Tx Mailbox 0,1,2 (CAN.Page.TxMailbox) */
      struct {

        /** CAN message control/status register (CAN.Page.TxMailbox.MCSR) */
        union {
          
          /// bytewise access to register
          uint8_t  Byte;
          
          /// bitwise access to register
          struct {
            int    TXRQ      : 1;    ///< Transmission mailbox request
            int    ABRQ      : 1;    ///< Abort request for mailbox
            int    RQCP      : 1;    ///< Request completed
            int    TXOK      : 1;    ///< Transmission OK
            int    ALST      : 1;    ///< Arbitration lost
            int    TERR      : 1;    ///< Transmission error
            int    res       : 2;    ///< Reserved
          } Reg;
          
        } MCSR;


        /** CAN mailbox data length control register (CAN.Page.TxMailbox.MDLCR) */
        union {
          
          /// bytewise access to register
          uint8_t  Byte;
          
          /// bitwise access to register
          struct {
            int    DLC       : 4;    ///< Data length code
            int    res       : 3;    ///< Reserved
            int    TGT       : 1;    ///< Transmit global time
          } Reg;
          
        } MDLCR;


        /** CAN mailbox identifier register 1 (CAN.Page.TxMailbox.MIDR1)*/
        union {
          
          /// bytewise access to register
          uint8_t  Byte;
          
          /// bitwise access to register
          struct {
            int    ID        : 5;    ///< STID[10:6] or EXID[28:24]
            int    RTR       : 1;    ///< Remote transmission request
            int    IDE       : 1;    ///< Extended identifier
            int    res       : 1;    ///< Reserved
          } Reg;
          
        } MIDR1;


        /** CAN mailbox identifier register 2 (CAN.Page.TxMailbox.MIDR2) */
        union {
          
          /// bytewise access to register
          uint8_t  Byte;
          
          /// bitwise access to register
          struct {
            int    EXID      : 2;    ///< EXID[17:16]
            int    ID        : 6;    ///< STID[5:0] or EXID[23:18]
          } Reg;
        } MIDR2;


        /** CAN mailbox identifier register 3 (CAN.Page.TxMailbox.MIDR3) */
        union {
          
          /// bytewise access to register
          uint8_t  Byte;
          
          /// bitwise access to register
          struct {
            int    EXID      : 8;    ///< EXID[15:8]
          } Reg;
          
        } MIDR3;


        /** CAN mailbox identifier register 4 (CAN.Page.TxMailbox.MIDR4) */
        union {
          
          /// bytewise access to register
          uint8_t  Byte;
          
          /// bitwise access to register
          struct {
            int    EXID      : 8;    ///< EXID[7:0]
          } Reg;
          
        } MIDR4;


        /** CAN mailbox data register 1 (CAN.Page.TxMailbox.MDAR1) */
        byte_t    MDAR1;


        /** CAN mailbox data register 2 (CAN.Page.TxMailbox.MDAR1) */
        byte_t    MDAR2;


        /** CAN mailbox data register 3 (CAN.Page.TxMailbox.MDAR1) */
        byte_t    MDAR3;


        /** CAN mailbox data register 4 (CAN.Page.TxMailbox.MDAR1) */
        byte_t    MDAR4;


        /** CAN mailbox data register 5 (CAN.Page.TxMailbox.MDAR1) */
        byte_t    MDAR5;


        /** CAN mailbox data register 6 (CAN.Page.TxMailbox.MDAR1) */
        byte_t    MDAR6;


        /** CAN mailbox data register 7 (CAN.Page.TxMailbox.MDAR1) */
        byte_t    MDAR7;


        /** CAN mailbox data register 8 (CAN.Page.TxMailbox.MDAR1) */
        byte_t    MDAR8;
        
        
        /** CAN mailbox time stamp register (CAN.Page.TxMailbox.MTSR) */
        word_t    MTSR;

      } TxMailbox;



      /** CAN page 2: Acceptance Filter 0:1 (CAN.Page.Filter01) */
      struct {

        // filter 0
        byte_t    FR01;
        byte_t    FR02;
        byte_t    FR03;
        byte_t    FR04;
        byte_t    FR05;
        byte_t    FR06;
        byte_t    FR07;
        byte_t    FR08;
      
        // filter 1
        byte_t    FR11;
        byte_t    FR12;
        byte_t    FR13;
        byte_t    FR14;
        byte_t    FR15;
        byte_t    FR16;
        byte_t    FR17;
        byte_t    FR18;

      } Filter01;



      /** CAN page 3: Acceptance Filter 2:3 (CAN.Page.Filter23) */
      struct {

        // filter 2
        byte_t    FR21;
        byte_t    FR22;
        byte_t    FR23;
        byte_t    FR24;
        byte_t    FR25;
        byte_t    FR26;
        byte_t    FR27;
        byte_t    FR28;
      
        // filter 3
        byte_t    FR31;
        byte_t    FR32;
        byte_t    FR33;
        byte_t    FR34;
        byte_t    FR35;
        byte_t    FR36;
        byte_t    FR37;
        byte_t    FR38;

      } Filter23;



      /** CAN page 4: Acceptance Filter 4:5 (CAN.Page.Filter45) */
      struct {

        // filter 4
        byte_t    FR41;
        byte_t    FR42;
        byte_t    FR43;
        byte_t    FR44;
        byte_t    FR45;
        byte_t    FR46;
        byte_t    FR47;
        byte_t    FR48;
      
        // filter 5
        byte_t    FR51;
        byte_t    FR52;
        byte_t    FR53;
        byte_t    FR54;
        byte_t    FR55;
        byte_t    FR56;
        byte_t    FR57;
        byte_t    FR58;

      } Filter45;



      /** CAN page 6: Configuration/Diagnostics (CAN.Page.Config) */
      struct {

        /** CAN error status register (CAN.Page.Config.ESR) */
        union {
          
          /// bytewise access to register
          uint8_t  Byte;
          
          /// bitwise access to register
          struct {
            int    EWGF      : 1;    ///< Error warning flag
            int    EPVF      : 1;    ///< Error passive flag
            int    BOFF      : 1;    ///< Bus off flag
            int    res       : 1;    ///< Reserved
            int    LEC       : 3;    ///< Last error code
            int    res2      : 1;    ///< Reserved
          } Reg;
          
