STM8-SPL-license/discussion/Header/STM8AF_STM8S_bitfield (Kopie 1).h
    } BRR2;


    /** UART1 Control register 1 (UART1_CR1) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    PIEN    : 1;    ///< Parity interrupt enable
        int    PS      : 1;    ///< Parity selection
        int    PCEN    : 1;    ///< Parity control enable
        int    WAKE    : 1;    ///< Wakeup method
        int    M       : 1;    ///< word length
        int    UARTD   : 1;    ///< UART Disable (for low power consumption)
        int    T8      : 1;    ///< Transmit Data bit 8 (in 9-bit mode)
        int    R8      : 1;    ///< Receive Data bit 8 (in 9-bit mode)
      } Reg;
      
    } CR1;


    /** UART1 Control register 2 (UART1_CR2) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    SBK     : 1;    ///< Send break
        int    RWU     : 1;    ///< Receiver wakeup
        int    REN     : 1;    ///< Receiver enable
        int    TEN     : 1;    ///< Transmitter enable
        int    ILIEN   : 1;    ///< IDLE Line interrupt enable
        int    RIEN    : 1;    ///< Receiver interrupt enable
        int    TCIEN   : 1;    ///< Transmission complete interrupt enable
        int    TIEN    : 1;    ///< Transmitter interrupt enable
      } Reg;
      
    } CR2;


    /** UART1 Control register 3 (UART1_CR3) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    LBCL    : 1;    ///< Last bit clock pulse
        int    CPHA    : 1;    ///< Clock phase
        int    CPOL    : 1;    ///< Clock polarity
        int    CKEN    : 1;    ///< Clock enable
        int    STOP    : 2;    ///< STOP bits
        int    LINEN   : 1;    ///< LIN mode enable
        int    res     : 1;    ///< Reserved, must be kept cleared
      } Reg;
      
    } CR3;


    /** UART1 Control register 4 (UART1_CR4) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    ADD     : 4;    ///< Address of the UART node
        int    LBDF    : 1;    ///< LIN Break Detection Flag
        int    LBDL    : 1;    ///< LIN Break Detection Length
        int    LBDIEN  : 1;    ///< LIN Break Detection Interrupt Enable
        int    res     : 1;    ///< Reserved, must be kept cleared
      } Reg;
      
    } CR4;


    /** UART1 Control register 5 (UART1_CR5) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    res     : 1;    ///< Reserved, must be kept cleared
        int    IREN    : 1;    ///< IrDA mode Enable
        int    IRLP    : 1;    ///< IrDA Low Power
        int    HDSEL   : 1;    ///< Half-Duplex Selection
        int    NACK    : 1;    ///< Smartcard NACK enable
        int    SCEN    : 1;    ///< Smartcard mode enable
        int    res2    : 2;    ///< Reserved, must be kept cleared
      } Reg;
      
    } CR5;


    /** UART1 guard time register register (UART1_GTR) */
    byte_t          GTR;


    /** UART1 prescaler register register register (UART1_PSCR) */
    byte_t          PSCR;

  } UART1_t;
    
  /// pointer to UART1 registers
  #if defined(UART1_BaseAddress)
    #define _UART1  (*((UART1_t *) UART1_BaseAddress))
  #endif

  /* UART1 Module Reset Values */
  #define UART1_SR_RESET_VALUE   ((uint8_t)0xC0)
  #define UART1_BRR1_RESET_VALUE ((uint8_t)0x00)
  #define UART1_BRR2_RESET_VALUE ((uint8_t)0x00)
  #define UART1_CR1_RESET_VALUE  ((uint8_t)0x00)
  #define UART1_CR2_RESET_VALUE  ((uint8_t)0x00)
  #define UART1_CR3_RESET_VALUE  ((uint8_t)0x00)
  #define UART1_CR4_RESET_VALUE  ((uint8_t)0x00)
  #define UART1_CR5_RESET_VALUE  ((uint8_t)0x00)
  #define UART1_GTR_RESET_VALUE  ((uint8_t)0x00)
  #define UART1_PSCR_RESET_VALUE ((uint8_t)0x00)

#endif // (1)



//------------------------
// UART2 Module (selected devices) with
//    asyncronous & synchronous mode
//    multiprocessor communication
//    SmartCard & IrDA mode
//    LIN master & slave mode
//------------------------
#if (1)   // dummy for filtering out in editor

  /** struct containing UART2 registers (selected devices) */
  typedef struct   {

    /** UART2 Status register (UART2_SR) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    PE      : 1;    ///< Parity error
        int    FE      : 1;    ///< Framing error
        int    NF      : 1;    ///< Noise flag
        int    OR_LHE  : 1;    ///< LIN Header Error (LIN slave mode) / Overrun error
        int    IDLE    : 1;    ///< IDLE line detected
        int    RXNE    : 1;    ///< Read data register not empty
        int    TC      : 1;    ///< Transmission complete
        int    TXE     : 1;    ///< Transmit data register empty
      } Reg;
      
    } SR;


    /** UART2 data register (UART2_DR) */
    byte_t          DR; 


    /** UART2 Baud rate register 1 (UART2_BRR1) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    UART_DIV_4_11 : 8;    ///< UART_DIV bits [11:4]
      } Reg;
      
    } BRR1;


    /** UART2 Baud rate register 2 (UART2_BRR2) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    UART_DIV_0_3   : 4;    ///< UART_DIV bits [3:0]
        int    UART_DIV_12_15 : 4;    ///< UART_DIV bits [15:12]
      } Reg;
      
    } BRR2;


    /** UART2 Control register 1 (UART2_CR1) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    PIEN    : 1;    ///< Parity interrupt enable
        int    PS      : 1;    ///< Parity selection
        int    PCEN    : 1;    ///< Parity control enable
        int    WAKE    : 1;    ///< Wakeup method
        int    M       : 1;    ///< word length
        int    UARTD   : 1;    ///< UART Disable (for low power consumption)
        int    T8      : 1;    ///< Transmit Data bit 8 (in 9-bit mode)
        int    R8      : 1;    ///< Receive Data bit 8 (in 9-bit mode)
      } Reg;
      
    } CR1;


    /** UART2 Control register 2 (UART2_CR2) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    SBK     : 1;    ///< Send break
        int    RWU     : 1;    ///< Receiver wakeup
        int    REN     : 1;    ///< Receiver enable
        int    TEN     : 1;    ///< Transmitter enable
        int    ILIEN   : 1;    ///< IDLE Line interrupt enable
        int    RIEN    : 1;    ///< Receiver interrupt enable
        int    TCIEN   : 1;    ///< Transmission complete interrupt enable
        int    TIEN    : 1;    ///< Transmitter interrupt enable
      } Reg;
      
