STM8-SPL-license/discussion/Header/STM8AF_STM8S_bitfield (Kopie 1).h
    /** UART4 Control register 4 (UART4_CR4) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    ADD     : 4;    ///< Address of the UART node
        int    LBDF    : 1;    ///< LIN Break Detection Flag
        int    LBDL    : 1;    ///< LIN Break Detection Length
        int    LBDIEN  : 1;    ///< LIN Break Detection Interrupt Enable
        int    res     : 1;    ///< Reserved, must be kept cleared
      } Reg;
      
    } CR4;


    /** UART4 Control register 5 (UART4_CR5) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    res     : 1;    ///< Reserved, must be kept cleared
        int    IREN    : 1;    ///< IrDA mode Enable
        int    IRLP    : 1;    ///< IrDA Low Power
        int    HDSEL   : 1;    ///< Half-Duplex Selection
        int    NACK    : 1;    ///< Smartcard NACK enable
        int    SCEN    : 1;    ///< Smartcard mode enable
        int    res2    : 2;    ///< Reserved, must be kept cleared
      } Reg;
      
    } CR5;


    /** UART4 Control register 6 (UART4_CR6) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    LSF     : 1;    ///< LIN Sync Field
        int    LHDF    : 1;    ///< LIN Header Detection Flag
        int    LHDIEN  : 1;    ///< LIN Header Detection Interrupt Enable
        int    res     : 1;    ///< Reserved
        int    LASE    : 1;    ///< LIN automatic resynchronisation enable
        int    LSLV    : 1;    ///< LIN Slave Enable
        int    res2    : 1;    ///< Reserved
        int    LDUM    : 1;    ///< LIN Divider Update Method
      } Reg;
      
    } CR6;


    /** UART4 guard time register register (UART4_GTR) */
    byte_t          GTR;


    /** UART4 prescaler register register register (UART4_PSCR) */
    byte_t          PSCR;

  } UART4_t;
    
  /// pointer to UART4 registers
  #if defined(UART4_BaseAddress)
    #define _UART4  (*((UART4_t *) UART4_BaseAddress))
  #endif

  /* UART4 Module Reset Values */
  #define UART4_SR_RESET_VALUE   ((uint8_t)0xC0)
  #define UART4_BRR1_RESET_VALUE ((uint8_t)0x00)
  #define UART4_BRR2_RESET_VALUE ((uint8_t)0x00)
  #define UART4_CR1_RESET_VALUE  ((uint8_t)0x00)
  #define UART4_CR2_RESET_VALUE  ((uint8_t)0x00)
  #define UART4_CR3_RESET_VALUE  ((uint8_t)0x00)
  #define UART4_CR4_RESET_VALUE  ((uint8_t)0x00)
  #define UART4_CR5_RESET_VALUE  ((uint8_t)0x00)
  #define UART4_CR6_RESET_VALUE  ((uint8_t)0x00)
  #define UART4_GTR_RESET_VALUE  ((uint8_t)0x00)
  #define UART4_PSCR_RESET_VALUE ((uint8_t)0x00)
 
#endif // (1)



//------------------------
// Analog Digital Converter ADC1 (selected devices) with result buffer & analog watchdog etc
//------------------------
#if (1)   // dummy for filtering out in editor

  /** struct containing ADC1 registers (selected devices) */
  typedef struct {

    /** ADC1 10-bit Data Buffer Register 0 (ADC1_DB0R) */
    word_t        DB0R;                    
                                         
    /** ADC1 10-bit Data Buffer Register 1 (ADC1_DB1R) */
    word_t        DB1R;                    
                                         
    /** ADC1 10-bit Data Buffer Register 2 (ADC1_DB2R) */
    word_t        DB2R;                    
                                         
    /** ADC1 10-bit Data Buffer Register 3 (ADC1_DB3R) */
    word_t        DB3R;                    
                                         
    /** ADC1 10-bit Data Buffer Register 4 (ADC1_DB4R) */
    word_t        DB4R;                    
                                         
    /** ADC1 10-bit Data Buffer Register 5 (ADC1_DB5R) */
    word_t        DB5R;                    
                                         
    /** ADC1 10-bit Data Buffer Register 6 (ADC1_DB6R) */
    word_t        DB6R;                    
                                         
    /** ADC1 10-bit Data Buffer Register 7 (ADC1_DB7R) */
    word_t        DB7R;                    
                                         
    /** ADC1 10-bit Data Buffer Register 8 (ADC1_DB8R) */
    word_t        DB8R;                    
                                         
    /** ADC1 10-bit Data Buffer Register 9 (ADC1_DB9R) */
    word_t        DB9R;


    /** Reserved register (12B) */
    uint8_t       res[12]; 


    /** ADC1 control/status register (ADC1_CSR) */
    union {

      /// bytewise access to register
      uint8_t  Byte;

      /// bitwise access to register
      struct {
        int    CH     : 4;  ///< Channel selection bits
        int    AWDIE  : 1;  ///< Analog watchdog interrupt enable
        int    EOCIE  : 1;  ///< Interrupt enable for EOC
        int    AWD    : 1;  ///< Analog Watchdog flag
        int    EOC    : 1;  ///< End of conversion
      } Reg;

    } CSR;


    /** ADC1 Configuration Register 1 (ADC1_CR1) */
    union {

      /// bytewise access to register
      uint8_t  Byte;

      /// bitwise access to register
      struct {
        int    ADON   : 1;  ///< A/D Converter on/off
        int    CONT   : 1;  ///< Continuous conversion
        int    res    : 2;  ///< Reserved, always read as 0
        int    SPSEL  : 3;  ///< Clock prescaler selection
        int    res2   : 1;  ///< Reserved, always read as 0
      } Reg;

    } CR1;


    /** ADC1 Configuration Register 2 (ADC1_CR2) */
    union {

      /// bytewise access to register
      uint8_t  Byte;

      /// bitwise access to register
      struct {
        int    res     : 1;  ///< Reserved, must be kept cleared
        int    SCAN    : 1;  ///< Scan mode enable
        int    res2    : 1;  ///< Reserved, must be kept cleared
        int    ALIGN   : 1;  ///< Data alignment
        int    EXTSEL  : 2;  ///< External event selection
        int    EXTTRIG : 1;  ///< External trigger enable
        int    res3    : 1;  ///< Reserved, must be kept cleared
      } Reg;

