STM8-SPL-license/discussion/Header/STM8AF_STM8S_bitfield (Kopie 1).h
    } CR2;


    /** ADC1 Configuration Register 3 (ADC1_CR3) */
    union {

      /// bytewise access to register
      uint8_t  Byte;

      /// bitwise access to register
      struct {
        int    res   : 6;  ///< Reserved, must be kept cleared
        int    OVR   : 1;  ///< Overrun flag
        int    DBUF  : 1;  ///< Data buffer enable
      } Reg;

    } CR3;


    /** ADC1 (unbuffered) 10-bit measurement result (ADC1_DR) */
    word_t        DR;

    /** ADC1 Schmitt trigger disable register (ADC1_TDR) */
    word_t        TDR;

    /** ADC1 watchdog high threshold register (ADC1_HTR) */
    word_t        HTR;

    /** ADC1 watchdog low threshold register (ADC1_LTR) */
    word_t        LTR;

    /** ADC1 watchdog status register (ADC1_AWSR) */
    word_t        AWSR;

    /** ADC1 watchdog control register (ADC1_AWCR) */
    word_t        AWCR;

  } ADC1_t;
    
  /// pointer to ADC1 registers
  #if defined(ADC1_BaseAddress)
    #define _ADC1  (*((ADC1_t *) ADC1_BaseAddress))
  #endif

  /* ADC1 Module Reset Values */
  #define  ADC1_CSR_RESET_VALUE    ((uint8_t)0x00)
  #define  ADC1_CR1_RESET_VALUE    ((uint8_t)0x00)
  #define  ADC1_CR2_RESET_VALUE    ((uint8_t)0x00)
  #define  ADC1_CR3_RESET_VALUE    ((uint8_t)0x00)
  #define  ADC1_TDRL_RESET_VALUE   ((uint8_t)0x00)
  #define  ADC1_TDRH_RESET_VALUE   ((uint8_t)0x00)
  #define  ADC1_HTRL_RESET_VALUE   ((uint8_t)0x03)
  #define  ADC1_HTRH_RESET_VALUE   ((uint8_t)0xFF)
  #define  ADC1_LTRH_RESET_VALUE   ((uint8_t)0x00)
  #define  ADC1_LTRL_RESET_VALUE   ((uint8_t)0x00)
  #define  ADC1_AWCRH_RESET_VALUE  ((uint8_t)0x00)
  #define  ADC1_AWCRL_RESET_VALUE  ((uint8_t)0x00)

#endif // (1)



//------------------------
// Analog Digital Converter ADC2 (selected devices) without result buffer, analog watchdog etc.
//------------------------
#if (1)   // dummy for filtering out in editor

  /** struct containing ADC2 registers (selected devices) */
  typedef struct {

    /** ADC2 control/status register (ADC2_CSR) */
    union {

      /// bytewise access to register
      uint8_t  Byte;

      /// bitwise access to register
      struct {
        int    CH      : 4;    ///< Channel selection bits
        int    res     : 1;    ///< Reserved
        int    EOCIE   : 1;    ///< Interrupt enable for EOC
        int    res2    : 1;    ///< Reserved
        int    EOC     : 1;    ///< End of conversion flag
      } Reg;

    } CSR;


    /** ADC2 Configuration Register 1 (ADC2_CR1) */
    union {

      /// bytewise access to register
      uint8_t  Byte;

      /// bitwise access to register
      struct {
        int    ADON   : 1;  ///< A/D Converter on/off
        int    CONT   : 1;  ///< Continuous conversion
        int    res    : 2;  ///< Reserved, always read as 0
        int    SPSEL  : 3;  ///< Clock prescaler selection
        int    res2   : 1;  ///< Reserved, always read as 0
      } Reg;

    } CR1;


    /** ADC2 Configuration Register 2 (ADC2_CR2) */
    union {

      /// bytewise access to register
      uint8_t  Byte;

      /// bitwise access to register
      struct {
        int    res     : 3;  ///< Reserved, must be kept cleared
        int    ALIGN   : 1;  ///< Data alignment
        int    EXTSEL  : 2;  ///< External event selection
        int    EXTTRIG : 1;  ///< External trigger enable
        int    res2    : 1;  ///< Reserved, must be kept cleared
      } Reg;

    } CR2;


    /** Reserved register (1B) */
    uint8_t         res[1]; 


    /** ADC2 (unbuffered) 10-bit measurement result (ADC2_DR) */
    word_t          DR;

    /** ADC2 Schmitt trigger disable register (ADC2_TDR) */
    word_t          TDR;

  } ADC2_t;
    
  /// pointer to all ADC2 registers
  #if defined(ADC2_BaseAddress)
    #define _ADC2  (*((ADC2_t *) ADC2_BaseAddress))
  #endif

  /* ADC2 Module Reset Values */
  #define  ADC2_CSR_RESET_VALUE  ((uint8_t)0x00)
  #define  ADC2_CR1_RESET_VALUE  ((uint8_t)0x00)
  #define  ADC2_CR2_RESET_VALUE  ((uint8_t)0x00)
  #define  ADC2_TDRL_RESET_VALUE ((uint8_t)0x00)
  #define  ADC2_TDRH_RESET_VALUE ((uint8_t)0x00)

#endif // (1)



//------------------------
// 16-Bit Timer TIM1 (all devices)
//------------------------
#if (1)   // dummy for filtering out in editor

  /** struct containing TIM1 registers (all devices) */
  typedef struct {

    /** TIM1 Control register 1 (TIM1_CR1) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    CEN     : 1;    ///< Counter enable
        int    UDIS    : 1;    ///< Update disable
        int    URS     : 1;    ///< Update request source
        int    OPM     : 1;    ///< One-pulse mode
        int    DIR     : 1;    ///< Direction
        int    CMS     : 2;    ///< Center-aligned mode selection
        int    ARPE    : 1;    ///< Auto-reload preload enable
      } Reg;
      
    } CR1;


    /** TIM1 Control register 2 (TIM1_CR2) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    CCPC    : 1;    ///< Capture/compare preloaded control
        int    res     : 1;    ///< Reserved, forced by hardware to 0
        int    COMS    : 1;    ///< Capture/compare control update selection
        int    res2    : 1;    ///< Reserved, must be kept cleared
        int    MMS     : 3;    ///< Master mode selection
        int    res3    : 1;    ///< Reserved
      } Reg;
      
    } CR2;


    /** Slave mode control register (TIM1_SMCR) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    SMS     : 3;    ///< Clock/trigger/slave mode selection
        int    res     : 1;    ///< Reserved
        int    TS      : 3;    ///< Trigger selection
        int    MSM     : 1;    ///< Master/slave mode
      } Reg;
      
    } SMCR;


    /** TIM1 External trigger register (TIM1_ETR) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    ETF     : 4;    ///< External trigger filter
        int    ETPS    : 2;    ///< External trigger prescaler
        int    ECE     : 1;    ///< External clock enable
        int    ETP     : 1;    ///< External trigger polarity
      } Reg;
      
    } ETR;


