STM8-SPL-license/discussion/Header/STM8AF_STM8S_bitfield (Kopie 1).h
    /** TIM1 Interrupt enable register (TIM1_IER) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    UIE     : 1;    ///< Update interrupt enable
        int    CC1IE   : 1;    ///< Capture/compare 1 interrupt enable
        int    CC2IE   : 1;    ///< Capture/compare 2 interrupt enable
        int    CC3IE   : 1;    ///< Capture/compare 3 interrupt enable
        int    CC4IE   : 1;    ///< Capture/compare 4 interrupt enable
        int    COMIE   : 1;    ///< Commutation interrupt enable
        int    TIE     : 1;    ///< Trigger interrupt enable
        int    BIE     : 1;    ///< Break interrupt enable
      } Reg;
      
    } IER;


    /** TIM1 Status register 1 (TIM1_SR1) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    UIF     : 1;    ///< Update interrupt flag
        int    CC1IF   : 1;    ///< Capture/compare 1 interrupt flag
        int    CC2IF   : 1;    ///< Capture/compare 2 interrupt flag
        int    CC3IF   : 1;    ///< Capture/compare 3 interrupt flag
        int    CC4IF   : 1;    ///< Capture/compare 4 interrupt flag
        int    COMIF   : 1;    ///< Commutation interrupt flag
        int    TIF     : 1;    ///< Trigger interrupt flag
        int    BIF     : 1;    ///< Break interrupt flag
      } Reg;
      
    } SR1;


    /** TIM1 Status register 2 (TIM1_SR2) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    res     : 1;    ///< Reserved, must be kept cleared
        int    CC1OF   : 1;    ///< Capture/compare 1 overcapture flag
        int    CC2OF   : 1;    ///< Capture/compare 2 overcapture flag
        int    CC3OF   : 1;    ///< Capture/compare 3 overcapture flag
        int    CC4OF   : 1;    ///< Capture/compare 4 overcapture flag
        int    res2    : 3;    ///< Reserved, must be kept cleared
      } Reg;
      
    } SR2;


    /** TIM1 Event generation register (TIM1_EGR) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    UG      : 1;    ///< Update generation
        int    CC1G    : 1;    ///< Capture/compare 1 generation
        int    CC2G    : 1;    ///< Capture/compare 2 generation
        int    CC3G    : 1;    ///< Capture/compare 3 generation
        int    CC4G    : 1;    ///< Capture/compare 4 generation
        int    COMG    : 1;    ///< Capture/compare control update generation
        int    TG      : 1;    ///< Trigger generation
        int    BG      : 1;    ///< Break generation
      } Reg;
      
    } EGR;


    /** TIM1 Capture/compare mode register 1 (TIM1_CCMR1) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register (output mode)
      struct {
        int    CC1S    : 2;    ///< Capture/compare 1 selection
        int    OC1FE   : 1;    ///< Output compare 1 fast enable
        int    OC1PE   : 1;    ///< Output compare 1 preload enable
        int    OC1M    : 3;    ///< Output compare 1 mode
        int    OC1CE   : 1;    ///< Output compare 1 clear enable
      } regOut;
      
      /// bitwise access to register (input mode)
      struct {
        int    CC1S    : 2;    ///< Capture/compare 1 selection
        int    IC1PSC  : 2;    ///< Input capture 1 prescaler
        int    IC1F    : 4;    ///< Input capture 1 filter
      } regIn;
      
    } CCMR1;


    /** TIM1 Capture/compare mode register 2 (TIM1_CCMR2) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register (output mode)
      struct {
        int    CC2S    : 2;    ///< Capture/compare 2 selection
        int    OC2FE   : 1;    ///< Output compare 2 fast enable
        int    OC2PE   : 1;    ///< Output compare 2 preload enable
        int    OC2M    : 3;    ///< Output compare 2 mode
        int    OC2CE   : 1;    ///< Output compare 2 clear enable
      } regOut;
      
      /// bitwise access to register (input mode)
      struct {
        int    CC2S    : 2;    ///< Capture/compare 2 selection
        int    IC2PSC  : 2;    ///< Input capture 2 prescaler
        int    IC2F    : 4;    ///< Input capture 2 filter
      } regIn;
      
    } CCMR2;


    /** TIM1 Capture/compare mode register 3 (TIM1_CCMR3) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register (output mode)
      struct {
        int    CC3S    : 2;    ///< Capture/compare 3 selection
        int    OC3FE   : 1;    ///< Output compare 3 fast enable
        int    OC3PE   : 1;    ///< Output compare 3 preload enable
        int    OC3M    : 3;    ///< Output compare 3 mode
        int    OC3CE   : 1;    ///< Output compare 3 clear enable
      } regOut;
        
      /// bitwise access to register (input mode)
      struct {
        int    CC3S    : 2;    ///< Capture/compare 3 selection
        int    IC3PSC  : 2;    ///< Input capture 3 prescaler
        int    IC3F    : 4;    ///< Input capture 3 filter
      } regIn;

    } CCMR3;


    /** TIM1 Capture/compare mode register 4 (TIM1_CCMR4) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register (output mode)
      struct {
        int    CC4S    : 2;    ///< Capture/compare 4 selection
        int    OC4FE   : 1;    ///< Output compare 4 fast enable
        int    OC4PE   : 1;    ///< Output compare 4 preload enable
        int    OC4M    : 3;    ///< Output compare 4 mode
        int    OC4CE   : 1;    ///< Output compare 4 clear enable
      } regOut;
        
