STM8-SPL-license/discussion/Header/STM8AF_STM8S_bitfield (Kopie 1).h
    } CR2;


    /** TIM5 Slave mode control register (TIM5_SMCR) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    SMS     : 3;    ///< Clock/trigger/slave mode selection
        int    res     : 1;    ///< Reserved
        int    TS      : 3;    ///< Trigger selection
        int    MSM     : 1;    ///< Master/slave mode
      } Reg;
      
    } SMCR;


    /** TIM5 Interrupt enable (TIM5_IER) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    UIE     : 1;    ///< Update interrupt enable
        int    CC1IE   : 1;    ///< Capture/compare 1 interrupt enable
        int    CC2IE   : 1;    ///< Capture/compare 2 interrupt enable
        int    CC3IE   : 1;    ///< Capture/compare 3 interrupt enable
        int    res     : 2;    ///< Reserved 
        int    TIE     : 1;    ///< Trigger interrupt enable
        int    res2    : 1;    ///< Reserved
      } Reg;
      
    } IER;


    /** TIM5 Status register 1 (TIM5_SR1) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    UIF     : 1;    ///< Update interrupt flag
        int    CC1IF   : 1;    ///< Capture/compare 1 interrupt flag
        int    CC2IF   : 1;    ///< Capture/compare 2 interrupt flag
        int    CC3IF   : 1;    ///< Capture/compare 3 interrupt flag
        int    res     : 2;    ///< Reserved
        int    TIF     : 1;    ///< Trigger interrupt flag
        int    res2    : 1;    ///< Reserved
      } Reg;
      
    } SR1;


    /** TIM5 Status register 2 (TIM5_SR2) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    res     : 1;    ///< Reserved
        int    CC1OF   : 1;    ///< Capture/compare 1 overcapture flag
        int    CC2OF   : 1;    ///< Capture/compare 2 overcapture flag
        int    CC3OF   : 1;    ///< Capture/compare 3 overcapture flag
        int    res2    : 4;    ///< Reserved
      } Reg;
      
    } SR2;


    /** TIM5 Event Generation (TIM5_EGR) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    UG      : 1;    ///< Update generation
        int    CC1G    : 1;    ///< Capture/compare 1 generation
        int    CC2G    : 1;    ///< Capture/compare 2 generation
        int    CC3G    : 1;    ///< Capture/compare 3 generation
        int    res     : 2;    ///< Reserved
        int    TG      : 1;    ///< Trigger generation
        int    res2    : 1;    ///< Reserved
      } Reg;
      
    } EGR;


    /** TIM5 Capture/compare mode register 1 (TIM5_CCMR1) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register (output mode)
      struct {
        int    CC1S    : 2;    ///< Capture/compare 1 selection
        int    res     : 1;    ///< Reserved
        int    OC1PE   : 1;    ///< Output compare 1 preload enable
        int    OC1M    : 3;    ///< Output compare 1 mode
        int    res2    : 1;    ///< Reserved
      } regOut;
      
      /// bitwise access to register (input mode)
      struct {
        int    CC1S    : 2;    ///< Capture/compare 1 selection
        int    IC1PSC  : 2;    ///< Input capture 1 prescaler
        int    IC1F    : 4;    ///< Input capture 1 filter
      } regIn;
      
    } CCMR1;


    /** TIM5 Capture/compare mode register 2 (TIM5_CCMR2) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register (output mode)
      struct {
        int    CC2S    : 2;    ///< Capture/compare 2 selection
        int    res     : 1;    ///< Reserved
        int    OC2PE   : 1;    ///< Output compare 2 preload enable
        int    OC2M    : 3;    ///< Output compare 2 mode
        int    res2    : 1;    ///< Reserved
      } regOut;
      
      /// bitwise access to register (input mode)
      struct {
        int    CC2S    : 2;    ///< Capture/compare 2 selection
        int    IC2PSC  : 2;    ///< Input capture 2 prescaler
        int    IC2F    : 4;    ///< Input capture 2 filter
      } regIn;
      
    } CCMR2;


    /** TIM5 Capture/compare mode register 3 (TIM5_CCMR3) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register (output mode)
      struct {
        int    CC3S    : 2;    ///< Capture/compare 3 selection
        int    res     : 1;    ///< Reserved
        int    OC3PE   : 1;    ///< Output compare 3 preload enable
        int    OC3M    : 3;    ///< Output compare 3 mode
        int    OC3CE   : 1;    ///< Reserved
      } regOut;
        
      /// bitwise access to register (input mode)
      struct {
        int    CC3S    : 2;    ///< Capture/compare 3 selection
        int    IC3PSC  : 2;    ///< Input capture 3 prescaler
        int    IC3F    : 4;    ///< Input capture 3 filter
      } regIn;

    } CCMR3;


    /** TIM5 Capture/compare enable register 1 (TIM5_CCER1) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    CC1E    : 1;    ///< Capture/compare 1 output enable
        int    CC1P    : 1;    ///< Capture/compare 1 output polarity
        int    res     : 2;    ///< Reserved
        int    CC2E    : 1;    ///< Capture/compare 2 output enable
        int    CC2P    : 1;    ///< Capture/compare 2 output polarity
        int    res2    : 2;    ///< Reserved
      } Reg;
      
