STM8-SPL-license/discussion/Header/STM8AF_STM8S_bitfield (Kopie 1).h
    } CCER1;


    /** TIM5 Capture/compare enable register 2 (TIM5_CCER2) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    CC3E    : 1;    ///< Capture/compare 3 output enable
        int    CC3P    : 1;    ///< Capture/compare 3 output polarity
        int    res     : 6;    ///< Reserved
      } Reg;
      
    } CCER2;


    /** TIM5 16-bit counter (TIM5_CNTR) */
    word_t        CNTR;


    /** TIM5 clock prescaler (TIM5_PSCR) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    PSC     : 4;    ///< clock prescaler
        int    res     : 4;    ///< Reserved
      } Reg;
      
    } PSCR;


    /** TIM5 16-bit re-load value (TIM5_ARR) */
    word_t        ARR;


    /** TIM5 16-bit capture/compare value 1 (TIM5_CCR1) */
    word_t        CCR1;


    /** TIM5 16-bit capture/compare value 2 (TIM5_CCR2) */
    word_t        CCR2;


    /** TIM5 16-bit capture/compare value 3 (TIM5_CCR3) */
    word_t        CCR3;

  } TIM5_t;

  /// pointer to all TIM5 registers (selected devices)
  #if defined(TIM5_BaseAddress)
    #define _TIM5  (*((TIM5_t *) TIM5_BaseAddress))
  #endif

  /* TIM5 Module Reset Values */
  #define TIM5_CR1_RESET_VALUE   ((uint8_t)0x00)
  #define TIM5_CR2_RESET_VALUE   ((uint8_t)0x00)
  #define TIM5_SMCR_RESET_VALUE  ((uint8_t)0x00)
  #define TIM5_IER_RESET_VALUE   ((uint8_t)0x00)
  #define TIM5_SR1_RESET_VALUE   ((uint8_t)0x00)
  #define TIM5_SR2_RESET_VALUE   ((uint8_t)0x00)
  #define TIM5_EGR_RESET_VALUE   ((uint8_t)0x00)
  #define TIM5_CCMR1_RESET_VALUE ((uint8_t)0x00)
  #define TIM5_CCMR2_RESET_VALUE ((uint8_t)0x00)
  #define TIM5_CCMR3_RESET_VALUE ((uint8_t)0x00)
  #define TIM5_CCER1_RESET_VALUE ((uint8_t)0x00)
  #define TIM5_CCER2_RESET_VALUE ((uint8_t)0x00)
  #define TIM5_CNTRH_RESET_VALUE ((uint8_t)0x00)
  #define TIM5_CNTRL_RESET_VALUE ((uint8_t)0x00)
  #define TIM5_PSCR_RESET_VALUE  ((uint8_t)0x00)
  #define TIM5_ARRH_RESET_VALUE  ((uint8_t)0xFF)
  #define TIM5_ARRL_RESET_VALUE  ((uint8_t)0xFF)
  #define TIM5_CCR1H_RESET_VALUE ((uint8_t)0x00)
  #define TIM5_CCR1L_RESET_VALUE ((uint8_t)0x00)
  #define TIM5_CCR2H_RESET_VALUE ((uint8_t)0x00)
  #define TIM5_CCR2L_RESET_VALUE ((uint8_t)0x00)
  #define TIM5_CCR3H_RESET_VALUE ((uint8_t)0x00)
  #define TIM5_CCR3L_RESET_VALUE ((uint8_t)0x00)

#endif // (1) 



//------------------------
// 8-Bit Timer TIM6 (selected devices)
//------------------------
#if (1)   // dummy for filtering out in editor

  /** struct containing TIM6 registers (selected devices) */
  typedef struct {

    /** TIM6 Control register (TIM6_CR1) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    CEN     : 1;    ///< Counter enable
        int    UDIS    : 1;    ///< Update disable
        int    URS     : 1;    ///< Update request source
        int    OPM     : 1;    ///< One-pulse mode
        int    res     : 3;    ///< Reserved
        int    ARPE    : 1;    ///< Auto-reload preload enable
      } Reg;
      
    } CR1;


    /** TIM6 Control register 2 (TIM6_CR2) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    res     : 4;    ///< Reserved
        int    MMS     : 3;    ///< Master mode selection
        int    res3    : 1;    ///< Reserved
      } Reg;
      
    } CR2;


    /// Slave mode control register (TIM6_SMCR) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    SMS     : 3;    ///< Clock/trigger/slave mode selection
        int    res     : 1;    ///< Reserved
        int    TS      : 3;    ///< Trigger selection
        int    MSM     : 1;    ///< Master/slave mode
      } Reg;
      
    } SMCR;


    /** TIM6 Interrupt enable (TIM6_IER) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    UIE     : 1;    ///< Update interrupt enable
        int    res     : 7;    ///< Reserved
      } Reg;
      
    } IER;


    /** TIM6 Status register (TIM6_SR1) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    UIF     : 1;    ///< Update interrupt flag
        int    res     : 7;    ///< Reserved
      } Reg;
      
    } SR1;


    /** TIM6 Event Generation (TIM6_EGR) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    UG      : 1;    ///< Update generation
        int    res     : 7;    ///< Reserved
      } Reg;
      
    } EGR;


    /** TIM6 8-bit counter (TIM6_CNTR) */
    byte_t        CNTR;


    /** TIM6 clock prescaler (TIM6_PSCR) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        uint8_t PSC     : 3;    ///< clock prescaler
        uint8_t res     : 5;    ///< Reserved
      } Reg;
      
    } PSCR;


    /** TIM6 8-bit auto-reload register (TIM6_ARR) */
    byte_t        ARR;

  } TIM6_t;

  /// pointer to all TIM6 registers (selected devices)
  #if defined(TIM6_BaseAddress)
    #define _TIM6  (*((TIM6_t *) TIM6_BaseAddress))
  #endif
  
  /* TIM6 Module Reset Values */
  #define TIM6_CR1_RESET_VALUE    ((uint8_t)0x00)
  #define TIM6_CR2_RESET_VALUE    ((uint8_t)0x00)
  #define TIM6_SMCR_RESET_VALUE   ((uint8_t)0x00)
  #define TIM6_IER_RESET_VALUE    ((uint8_t)0x00)
  #define TIM6_SR1_RESET_VALUE    ((uint8_t)0x00)
  #define TIM6_EGR_RESET_VALUE    ((uint8_t)0x00)
  #define TIM6_CNTR_RESET_VALUE   ((uint8_t)0x00)
  #define TIM6_PSCR_RESET_VALUE   ((uint8_t)0x00)
  #define TIM6_ARR_RESET_VALUE    ((uint8_t)0xFF)

#endif // (1) 


/*-----------------------------------------------------------------------------
    END OF MODULE DEFINITION FOR MULTIPLE INLUSION
-----------------------------------------------------------------------------*/
#endif // _STM8AF_STM8S_H_
